Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceInvalidSpacing Property
 Constraints not satisfied, cannot generate gridlines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceInvalidSpacing { get; }
Public Shared ReadOnly Property DividedSurfaceInvalidSpacing As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceInvalidSpacing {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceInvalidSpacing : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace